zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43B43ZC7/drivers/fsl_clock.h
/*! @brief Clock ip name array for AOI. */
#define AOI_CLOCKS  \
    {               \
        kCLOCK_Aoi0 \
    }

/*! @brief Clock ip name array for PWM. */
#define PWM_CLOCKS                                            \
    {                                                         \
        {                                                     \
            kCLOCK_Flexpwm0, kCLOCK_Flexpwm0, kCLOCK_Flexpwm0 \
        }                                                     \
    }

/*! @brief Clock ip name array for GDET. */
#define GDET_CLOCKS         \
    {                       \
        kCLOCK_Gdet_wrapper \
    }

/*! @brief Clock name used to get clock frequency.
 *
 * These clocks source would be generated from SCG module.
 */
typedef enum _clock_name
{
    /* ----------------------------- System layer clock -------------------------------*/
    kCLOCK_CoreSysClk, /*!< Cortex M33 clock. */
    kCLOCK_SlowClk,    /*!< SLOW_CLK with DIVSLOW. */
    kCLOCK_PlatClk,    /*!< PLAT_CLK. */
    kCLOCK_SysClk,     /*!< SYS_CLK. */
    kCLOCK_BusClk,     /*!< BUS_CLK with DIVBUS. */

    /* For SCG CLK intput */
    kCLOCK_ScgSysOscClk, /*!< SCG system OSC clock.                               */
    kCLOCK_ScgSircClk,   /*!< SCG SIRC clock.                                     */
    kCLOCK_ScgFircClk,   /*!< SCG FIRC clock.                                     */
    kCLOCK_RtcOscClk,    /*!< RTC OSC clock.                                      */
} clock_name_t;

/*!
 * @brief Clock source for peripherals that support various clock selections.
 *
 * These options are for MRCC->XX[CC]
 */
typedef enum _clock_ip_control
{
    kCLOCK_IpClkControl_fun0 =
        MRCC_CC(0U), /*!< Peripheral clocks are disabled, module does not stall low power mode entry. */
    kCLOCK_IpClkControl_fun1 =
        MRCC_CC(1U), /*!< Peripheral clocks are enabled, module does not stall low power mode entry. */
    kCLOCK_IpClkControl_fun2 = MRCC_CC(2U), /*!< Peripheral clocks are enabled unless module is idle, low power mode
                                      entry stalls until module is idle. */
    kCLOCK_IpClkControl_fun3 =
        MRCC_CC(3U), /*!<  Peripheral clocks are enabled unless in SLEEP (or lower) mode, low power mode entry stalls
               until module is idle. Peripheral functional clocks that remain enabled in SLEEP mode are enabled and do
               not stall low power mode entry unless entering DEEPSLEEP (or lower) mode. */
} clock_ip_control_t;

/*!
 * @brief Clock source for peripherals that support various clock selections.
 *
 * These options are for MRCC->XX[MUX].
 */
typedef enum _clock_ip_src
{
    kCLOCK_IpSrcFro6M   = 0U, /*!< FRO 6M clock. */
    kCLOCK_IpSrcFro192M = 1U, /*!< FRO 192M clock. */
    kCLOCK_IpSrcSoscClk = 2U, /*!< OSC RF clock. */
    kCLOCK_IpSrc32kClk  = 3U, /*!< 32k Clk clock. */
    kCLOCK_IpSrcFro200M = 4U, /*!< FRO_200M clock for CAN. */
    kCLOCK_IpSrc1M      = 5U, /*!< 1MHZ is derived out of FRO6M. */
} clock_ip_src_t;

/*!
 * @brief "IP Connector name definition used for clock gate, clock source
 * and clock divider setting. It is defined as the corresponding register address.
 */
#define MAKE_MRCC_REGADDR(base, offset) ((base) + (offset))

#if defined(FSL_SDK_FORCE_CLK_DRIVER_NS_ACCESS) && FSL_SDK_FORCE_CLK_DRIVER_NS_ACCESS
#define CLOCK_REG(name) ((*(volatile uint32_t *)((uint32_t)(name) & ~0x10000000UL)))
#else
#define CLOCK_REG(name) (*(volatile uint32_t *)((uint32_t)(name)))
#endif

/*!
 * @brief Clock IP name.
 */
typedef enum _clock_ip_name
{
    kCLOCK_NOGATE          = 0U,                                    /*!< No clock gate for the IP in MRCC */
    kCLOCK_Lpadc0          = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0xA0),  /*!< Clock adc0 */
    kCLOCK_Aoi0            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0xA8),  /*!< Clock aoi0 */
    kCLOCK_Atx0            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0xB0),  /*!< Clock atx0 */
    kCLOCK_CLK_1M          = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0xB8),  /*!< Clock clk_1m */
    kCLOCK_CLK_6M          = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0xC0),  /*!< Clock clk_6m */
    kCLOCK_CLK_32M         = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0xC8),  /*!< Clock clk_32m */
    kCLOCK_Cmp0            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0xD0),  /*!< Clock cmp0 */
    kCLOCK_Crc0            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0xD8),  /*!< Clock crc0 */
    kCLOCK_Crc1            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0xE0),  /*!< Clock crc1 */
    kCLOCK_Data_stream_2p4 = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0xE8),  /*!< Clock data_stream_2p4 */
    kCLOCK_Dma0            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0xF0),  /*!< Clock dma */
    kCLOCK_Dsp_ramc0       = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0xF8),  /*!< Clock dsp_ramc0 */
    kCLOCK_Edt_cc          = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x100), /*!< Clock edt_cc */
    kCLOCK_Ewm0            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x108), /*!< Clock ewm0 */
    kCLOCK_Ezramc_ram0     = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x110), /*!< Clock ezramc_ram0 */
    kCLOCK_Ezramc_ram1     = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x118), /*!< Clock ezramc_ram1 */
    kCLOCK_Ezramc_ram2     = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x120), /*!< Clock ezramc_ram2 */
    kCLOCK_Ezramc_ram3     = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x128), /*!< Clock ezramc_ram3 */
    kCLOCK_Can0            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x130), /*!< Clock Can0 */
    kCLOCK_Flexpwm0        = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x138), /*!< Clock flexpwm0 */
    kCLOCK_Fmc             = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x140), /*!< Clock fmc */
    kCLOCK_Fro200m         = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x148), /*!< Clock FRO200M */
    kCLOCK_Fro_hf_div      = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x150), /*!< Clock fro_hf_div */
    kCLOCK_Gdet_wrapper    = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x158), /*!< Clock gdet_wrapper */
    kCLOCK_GpioA           = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x160), /*!< Clock gpioA */
    kCLOCK_GpioB           = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x168), /*!< Clock gpioB */
    kCLOCK_GpioC           = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x170), /*!< Clock gpioC */
    kCLOCK_Intm            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x178), /*!< Clock intm */
    kCLOCK_Ipsync_Trng0    = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x180), /*!< Clock IPSYNC_TRNG0 */
    kCLOCK_Itrc            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x188), /*!< Clock itrc */
    kCLOCK_Lpi2c0          = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x190), /*!< Clock lpi2c0 */
    kCLOCK_Lpi2c1          = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x198), /*!< Clock lpi2c1 */
    kCLOCK_Lpit0           = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x1A0), /*!< Clock lpit0 */
    kCLOCK_Lpspi0          = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x1A8), /*!< Clock lpspi0 */
    kCLOCK_Lpspi1          = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x1B0), /*!< Clock lpspi1 */
    kCLOCK_Lpspi2          = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x1B8), /*!< Clock lpspi2 */
    kCLOCK_Lptmr0          = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x1C0), /*!< Clock lptmr0 */
    kCLOCK_Lptmr1          = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x1C8), /*!< Clock lptmr1 */
    kCLOCK_Lpuart0         = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x1D0), /*!< Clock lpuart0 */
    kCLOCK_Lpuart1         = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x1D8), /*!< Clock lpuart1 */
    kCLOCK_Mtr             = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x1E0), /*!< Clock mtr */
    kCLOCK_Mu0             = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x1E8), /*!< Clock mu0 */
    kCLOCK_Mu1             = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x1F0), /*!< Clock mu1 */
    kCLOCK_Pkc_Ram_Ctrl    = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x1F8), /*!< Clock pck_ram_ctrl */
    kCLOCK_Pkc_wrapper     = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x200), /*!< Clock pkc_wrapper */
    kCLOCK_PortA           = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x208), /*!< Clock portA */
    kCLOCK_PortB           = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x210), /*!< Clock portB */
    kCLOCK_PortC           = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x218), /*!< Clock portC */
    kCLOCK_Romcp           = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x220), /*!< Clock romcp */
    kCLOCK_Sema            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x228), /*!< Clock Sema */
    kCLOCK_Sfa0            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x230), /*!< Clock sfa0 */
    kCLOCK_Sfa1            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x238), /*!< Clock sfa1 */
    kCLOCK_Sgi0            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x240), /*!< Clock sgi0 */
    kCLOCK_Syspm0          = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x248), /*!< Clock syspm */
    kCLOCK_Tcu             = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x250), /*!< Clock Tcu */
    kCLOCK_Tpm0            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x258), /*!< Clock tpm0 */
    kCLOCK_Tpm1            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x260), /*!< Clock tpm1 */
    kCLOCK_Tpm2            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x268), /*!< Clock tpm2 */
    kCLOCK_Tpm3            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x270), /*!< Clock tpm3 */
    kCLOCK_Tpm4            = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x278), /*!< Clock tpm4 */
    kCLOCK_Trgmux0         = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x280), /*!< Clock trgmux0 */
    kCLOCK_Tstmr0          = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x288), /*!< Clock tstmr0 */
    kCLOCK_Uteal1          = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x298), /*!< Clock uteal_1 */
    kCLOCK_Wdog0           = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x2A0), /*!< Clock wdog0 */
    kCLOCK_Wdog1           = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x2A8), /*!< Clock wdog1 */
    kCLOCK_Zenv_core       = MAKE_MRCC_REGADDR(MRCC_0_BASE, 0x2B0), /*!< Clock zenv_core */
} clock_ip_name_t;

/*!
 * @brief SCG status return codes.
 */
enum _scg_status
{
    kStatus_SCG_Busy       = MAKE_STATUS(kStatusGroup_SCG, 1), /*!< Clock is busy.  */
    kStatus_SCG_InvalidSrc = MAKE_STATUS(kStatusGroup_SCG, 2)  /*!< Invalid source. */
};

/*!
 * @brief SCG system clock type.
 */
typedef enum _scg_sys_clk
{
    kSCG_SysClkSlow,     /*!< System slow clock. */
    kSCG_SysClkBus,      /*!< Bus clock.         */
    kSCG_SysClkPlatform, /*!< Platform clock.    */
    kSCG_SysClkCore,     /*!< Core0 clock.       */
    kSCG_SysClkCore1,    /*!< Core1 clock.       */
} scg_sys_clk_t;

/*!
 * @brief SCG system clock source.
 */
typedef enum _scg_sys_clk_src
{
    kSCG_SysClkSrcSysOsc = 1U, /*!< System OSC. */
    kSCG_SysClkSrcSirc   = 2U, /*!< Slow IRC.   */
    kSCG_SysClkSrcFirc   = 3U, /*!< Fast IRC.   */
    kSCG_SysClkSrcRosc   = 4U, /*!< RTC OSC. */
} scg_sys_clk_src_t;

/*!
 * @brief SCG system clock divider value.
 */
typedef enum _scg_sys_clk_div
{
    kSCG_SysClkDivBy1  = 0U,  /*!< Divided by 1.  */
    kSCG_SysClkDivBy2  = 1U,  /*!< Divided by 2.  */
    kSCG_SysClkDivBy3  = 2U,  /*!< Divided by 3.  */
    kSCG_SysClkDivBy4  = 3U,  /*!< Divided by 4.  */
    kSCG_SysClkDivBy5  = 4U,  /*!< Divided by 5.  */
    kSCG_SysClkDivBy6  = 5U,  /*!< Divided by 6.  */
    kSCG_SysClkDivBy7  = 6U,  /*!< Divided by 7.  */
    kSCG_SysClkDivBy8  = 7U,  /*!< Divided by 8.  */
    kSCG_SysClkDivBy9  = 8U,  /*!< Divided by 9.  */
    kSCG_SysClkDivBy10 = 9U,  /*!< Divided by 10. */
    kSCG_SysClkDivBy11 = 10U, /*!< Divided by 11. */
    kSCG_SysClkDivBy12 = 11U, /*!< Divided by 12. */
    kSCG_SysClkDivBy13 = 12U, /*!< Divided by 13. */
    kSCG_SysClkDivBy14 = 13U, /*!< Divided by 14. */
    kSCG_SysClkDivBy15 = 14U, /*!< Divided by 15. */
    kSCG_SysClkDivBy16 = 15U  /*!< Divided by 16. */
} scg_sys_clk_div_t;

/*!
 * @brief SCG system clock configuration.
 */
typedef struct _scg_sys_clk_config
{
    uint32_t divSlow : 4;  /*!< Slow clock divider, see @ref scg_sys_clk_div_t. */
    uint32_t divBus : 4;   /*!< Bus clock divider, see @ref scg_sys_clk_div_t.  */
    uint32_t : 4;          /*!< Reserved. */
    uint32_t divCore1 : 4; /*!< Core1 clock divider (core#1), see @ref scg_sys_clk_div_t. */
    uint32_t divCore : 4;  /*!< Core0 clock divider (core#0), see @ref scg_sys_clk_div_t. */
    uint32_t : 4;          /*!< Reserved. */
    uint32_t src : 3;      /*!< System clock source, see @ref scg_sys_clk_src_t. */
    uint32_t : 5;          /*!< reserved. */
} scg_sys_clk_config_t;

/*!
 * @brief SCG clock out configuration (CLKOUTSEL).
 */
typedef enum _clock_clkout_src
{
    kClockClkoutSelScgSlow   = 0U, /*!< SCG Slow clock. */
    kClockClkoutSelSosc      = 1U, /*!< System OSC.     */
    kClockClkoutSelSirc      = 2U, /*!< Slow IRC.       */
    kClockClkoutSelFirc      = 3U, /*!< Fast IRC.       */
    kClockClkoutSelScgRtcOsc = 4U, /*!< SCG RTC OSC clock. */
} clock_clkout_src_t;

/*!
 * @brief SCG system OSC monitor mode.
 */
typedef enum _scg_sosc_monitor_mode
{
    kSCG_SysOscMonitorDisable = 0U,                         /*!< Monitor disabled. */
    kSCG_SysOscMonitorInt     = SCG_SOSCCSR_SOSCCM_MASK,    /*!< Interrupt when the SOSC error is detected. */
    kSCG_SysOscMonitorReset =
        SCG_SOSCCSR_SOSCCM_MASK | SCG_SOSCCSR_SOSCCMRE_MASK /*!< Reset when the SOSC error is detected.     */
} scg_sosc_monitor_mode_t;

/*! @brief SOSC enable mode. */
enum
{
    kSCG_SoscDisable          = 0,                         /*!< Disable SOSC clock.                    */
    kSCG_SoscEnable           = SCG_SOSCCSR_SOSCEN_MASK,   /*!< Enable SOSC clock.                     */
    kSCG_SoscEnableInSleep    = SCG_SOSCCSR_SOSCSTEN_MASK, /*!< Enable SOSC in stop mode.              */
    kSCG_SoscEnableInLowPower = SCG_SOSCCSR_SOSCLPEN_MASK, /*!< Enable SOSC in low power (VLP) mode.   */
};

/*!
 * @brief SCG system OSC configuration.
 */
typedef struct _scg_sosc_config
{
    uint32_t freq;                       /*!< System OSC frequency. */
    uint32_t enableMode;                 /*!< Enable mode, OR'ed value of _scg_sosc_enable_mode.  */
    scg_sosc_monitor_mode_t monitorMode; /*!< Clock monitor mode selected.     */
} scg_sosc_config_t;

/*!
 * @brief SCG ROSC monitor mode.
 */
typedef enum _scg_rosc_monitor_mode
{
    kSCG_RoscMonitorDisable = 0U,                           /*!< Monitor disabled. */
    kSCG_RoscMonitorInt     = SCG_ROSCCSR_ROSCCM_MASK,      /*!< Interrupt when the RTC OSC error is detected. */
    kSCG_RoscMonitorReset =
        SCG_ROSCCSR_ROSCCM_MASK | SCG_ROSCCSR_ROSCCMRE_MASK /*!< Reset when the RTC OSC error is detected. */
} scg_rosc_monitor_mode_t;

/*!
 * @brief SCG ROSC configuration.
 */
typedef struct _scg_rosc_config
{
    scg_rosc_monitor_mode_t monitorMode; /*!< Clock monitor mode selected.     */
} scg_rosc_config_t;

/*! @brief SIRC enable mode. */
typedef enum _scg_sirc_enable_mode
{
    kSCG_SircDisableInSleep   = 0,                         /*!< Disable SIRC in stop mode.             */
    kSCG_SircEnableInSleep    = SCG_SIRCCSR_SIRCSTEN_MASK, /*!< Enable SIRC in stop mode.              */
    kSCG_SircEnableInLowPower = SCG_SIRCCSR_SIRCLPEN_MASK, /*!< Enable SIRC in low power (VLP) mode.   */
} scg_sirc_enable_mode_t;

/*!
 * @brief SCG slow IRC clock configuration.
 */
typedef struct _scg_sirc_config
{
    scg_sirc_enable_mode_t enableMode; /*!< Enable mode, OR'ed value of _scg_sirc_enable_mode. */
} scg_sirc_config_t;

/*!
 * @brief SCG fast IRC trim mode.
 */
typedef enum _scg_firc_trim_mode
{
    kSCG_FircTrimNonUpdate = SCG_FIRCCSR_FIRCTREN_MASK,
    /*!< FIRC trim enable but not enable trim value update. In this mode, the
     trim value is fixed to the initialized value which is defined by
     trimCoar and trimFine in configure structure \ref scg_firc_trim_config_t.*/

    kSCG_FircTrimUpdate = SCG_FIRCCSR_FIRCTREN_MASK | SCG_FIRCCSR_FIRCTRUP_MASK
    /*!< FIRC trim enable and trim value update enable. In this mode, the trim
     value is auto update. */

} scg_firc_trim_mode_t;

/*!
 * @brief SCG fast IRC trim source.
 */
typedef enum _scg_firc_trim_src
{
    kSCG_FircTrimSrcSysOsc = 2U, /*!< System OSC.                 */
    kSCG_FircTrimSrcRtcOsc = 3U, /*!< RTC OSC (32.768 kHz).       */
} scg_firc_trim_src_t;

/*!
 * @brief SCG fast IRC clock trim configuration.
 */
typedef struct _scg_firc_trim_config
{
    scg_firc_trim_mode_t trimMode; /*!< FIRC trim mode.                       */
    scg_firc_trim_src_t trimSrc;   /*!< Trim source.                          */
    uint16_t trimDiv;              /*!< Divider of SOSC for FIRC.             */

