zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43B43ZC7/drivers/fsl_clock.h
    uint8_t trimCoar;              /*!< Trim coarse value; Irrelevant if trimMode is kSCG_FircTrimUpdate. */
    uint8_t trimFine;              /*!< Trim fine value; Irrelevant if trimMode is kSCG_FircTrimUpdate. */
} scg_firc_trim_config_t;

/*! @brief FIRC enable mode. */
enum
{
    kSCG_FircDisable          = 0,                         /*!< Disable FIRC clock.                    */
    kSCG_FircEnable           = SCG_FIRCCSR_FIRCEN_MASK,   /*!< Enable FIRC clock.                     */
    kSCG_FircEnableInSleep    = SCG_FIRCCSR_FIRCSTEN_MASK, /*!< Enable FIRC in stop mode.              */
    kSCG_FircEnableInLowPower = SCG_FIRCCSR_FIRCLPEN_MASK, /*!< Enable FIRC in low power (VLP) mode.   */
};

/*!
 * @brief SCG fast IRC clock frequency range.
 */
typedef enum _scg_firc_range
{
    kSCG_FircRange48M,  /*!< Fast IRC is trimmed to 48 MHz. */
    kSCG_FircRange64M,  /*!< Fast IRC is trimmed to 64 MHz. */
    kSCG_FircRange96M,  /*!< Fast IRC is trimmed to 96 MHz. */
    kSCG_FircRange192M, /*!< Fast IRC is trimmed to 192 MHz. */
} scg_firc_range_t;

/*!
 * @brief SCG fast IRC clock configuration.
 */
typedef struct _scg_firc_config_t
{
    uint32_t enableMode;                      /*!< Enable mode. */
    scg_firc_range_t range;                   /*!< Fast IRC frequency range. */

    const scg_firc_trim_config_t *trimConfig; /*!< Pointer to the FIRC trim configuration; set NULL to disable trim. */
} scg_firc_config_t;

typedef enum _tstmr_clk_sel
{
    kTSTMR_ClkSel_FIRCDix = 1,
    kTSTMR_ClkSel_SOSC    = 2,
    kTSTMR_ClkSel_32kHz   = 3,
    kTSTMR_ClkSel_1MHz    = 5, /*!< TSTMR 1MHz precision. */
} tstmr_clk_sel_t;

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/*!
 * @brief Specific clock enablement for TSTMR0 : need to configure source clock.
 *
 * @param src which source clock to count  \ref tstmr_clk_sel_t.
 * @param cc  clock control \ref clock_ip_control_t.
 */
static inline void CLOCK_StartTstmr0(tstmr_clk_sel_t src, clock_ip_control_t cc)
{
    uint32_t reg = CLOCK_REG(kCLOCK_Tstmr0);

    assert(reg & MRCC_PR_MASK);
    assert(kCLOCK_IpClkControl_fun1 == cc || kCLOCK_IpClkControl_fun2 == cc || kCLOCK_IpClkControl_fun3 == cc);
    if ((reg & MRCC_PR_MASK) == MRCC_PR_MASK)
    {
        reg |= MRCC_RSTB_MASK;
    }
    reg &= ~(MRCC_MUX_MASK | MRCC_CC_MASK);
    reg |= (MRCC_MUX(src) | ((uint32_t)cc & MRCC_CC_MASK));

    /*
     * If clock is already enabled, first disable it, then set the clock
     * source and re-enable it.
     */
    CLOCK_REG(kCLOCK_Tstmr0) = reg & (~MRCC_CC_MASK);
    CLOCK_REG(kCLOCK_Tstmr0) = reg;
}

/**
 * @brief Check if the clock has a clock divider register
 *
 * @param name Clock name
 * @return true if clock divider exists, false otherwise
 */
static inline volatile uint32_t *CLOCK_GetClockDivider(clock_ip_name_t name)
{
    volatile uint32_t *pDiv = NULL;

    if ((name == kCLOCK_Lpadc0) || (name == kCLOCK_Ewm0) || (name == kCLOCK_Can0) || (name == kCLOCK_Fro_hf_div) ||
        (name == kCLOCK_Gdet_wrapper) || (name == kCLOCK_Lpi2c0) || (name == kCLOCK_Lpi2c1) || (name == kCLOCK_Lpit0) ||
        (name == kCLOCK_Lpspi0) || (name == kCLOCK_Lpspi1) || (name == kCLOCK_Lpspi2) || (name == kCLOCK_Lptmr0) ||
        (name == kCLOCK_Lptmr1) || (name == kCLOCK_Lpuart0) || (name == kCLOCK_Lpuart1) || (name == kCLOCK_Tpm0) ||
        (name == kCLOCK_Tpm1) || (name == kCLOCK_Tpm2) || (name == kCLOCK_Tpm3) || (name == kCLOCK_Tpm4) ||
        (name == kCLOCK_Wdog0) || (name == kCLOCK_Wdog1))
    {
        pDiv = (volatile uint32_t *)((uint32_t)name + 4U);
    }

    return pDiv;
}

/*!
 * @brief Enable the clock for specific IP in low power mode.
 *
 * @param name  Which clock to enable, see \ref clock_ip_name_t.
 * @param control  Clock Config, see \ref clock_ip_control_t.
 */
static inline void CLOCK_EnableClockLPMode(clock_ip_name_t name, clock_ip_control_t control)
{
    if (kCLOCK_NOGATE == name)
    {
        return;
    }
    if (kCLOCK_Tstmr0 == name)
    {
        CLOCK_StartTstmr0(kTSTMR_ClkSel_1MHz, kCLOCK_IpClkControl_fun1);
    }
    else
    {
        assert(kCLOCK_IpClkControl_fun1 == control || kCLOCK_IpClkControl_fun2 == control ||
               kCLOCK_IpClkControl_fun3 == control);

        uint32_t reg = CLOCK_REG(name);

        /* return early if the clock is already enabled with the same control mode */
        if ((reg & MRCC_CC_MASK) == (uint32_t)control)
        {
            return;
        }

        CLOCK_REG(name) &= (~MRCC_CC_MASK);
        CLOCK_REG(name) |= (MRCC_CC_MASK & (uint32_t)control);
    }

    if ((CLOCK_REG(name) & MRCC_PR_MASK) == MRCC_PR_MASK)
    {
        CLOCK_REG(name) |= MRCC_RSTB_MASK;
    }

    volatile uint32_t *pDivCtrl = NULL;

    pDivCtrl = CLOCK_GetClockDivider(name);

    if (NULL != pDivCtrl)
    {
        /* Enable divider clock and release it from reset state */
        *pDivCtrl &= ~(MRCC_HALT_MASK | MRCC_RESET_MASK);
    }

    /* Make sure enable clock finished */
    __ISB();
    __DSB();
}

/*!
 * @brief Enable the clock for specific IP.
 *
 * @param name  Which clock to enable, see \ref clock_ip_name_t.
 */
static inline void CLOCK_EnableClock(clock_ip_name_t name)
{
    CLOCK_EnableClockLPMode(name, kCLOCK_IpClkControl_fun1);
}

/*!
 * @brief Disable the clock for specific IP.
 *
 * @param name  Which clock to disable, see \ref clock_ip_name_t.
 */
static inline void CLOCK_DisableClock(clock_ip_name_t name)
{
    if (kCLOCK_NOGATE == name)
    {
        return;
    }

    CLOCK_REG(name) &= ~MRCC_CC_MASK;

    if ((CLOCK_REG(name) & MRCC_PR_MASK) == MRCC_PR_MASK)
    {
        CLOCK_REG(name) &= ~MRCC_RSTB_MASK;
    }

    volatile uint32_t *pDivCtrl = NULL;

    pDivCtrl = CLOCK_GetClockDivider(name);

    if (NULL != pDivCtrl)
    {
        /* Disable divider clock and put it in reset state */
        *pDivCtrl |= (MRCC_HALT_MASK | MRCC_RESET_MASK);
    }
}

/*!
 * @brief Set the clock source for specific IP module.
 *
 * Set the clock source for specific IP, not all modules need to set the
 * clock source, should only use this function for the modules need source
 * setting.
 *
 * @param name Which peripheral to check, see \ref clock_ip_name_t.
 * @param src Clock source to set.
 */
static inline void CLOCK_SetIpSrc(clock_ip_name_t name, clock_ip_src_t src)
{
    if (kCLOCK_NOGATE == name)
    {
        return;
    }

