zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43B43ZC7/drivers/fsl_clock.h
    CLOCK_REG(&SCG_0->SOSCCSR) = reg;
}

/*!
 * @brief Checks whether the system OSC clock is valid.
 *
 * @return  True if clock is valid, false if not.
 */
static inline bool CLOCK_IsSysOscValid(void)
{
    return (bool)(CLOCK_REG(&SCG_0->SOSCCSR) & SCG_SOSCCSR_SOSCVLD_MASK);
}

/*!
 * @brief Unlock the SOSCCSR control status register.
 */
static inline void CLOCK_UnlockSysOscControlStatusReg(void)
{
    CLOCK_REG(&SCG_0->SOSCCSR) &= ~(SCG_SOSCCSR_LK_MASK);
}

/*!
 * @brief Lock the SOSCCSR control status register.
 */
static inline void CLOCK_LockSysOscControlStatusReg(void)
{
    CLOCK_REG(&SCG_0->SOSCCSR) |= SCG_SOSCCSR_LK_MASK;
}

/* @} */

/*!
 * @name SCG Slow IRC Clock.
 * @{
 */

/*!
 * @brief Initializes the SCG slow IRC clock.
 *
 * This function enables the SCG slow IRC clock according to the
 * configuration.
 *
 * @param config   Pointer to the configuration structure.
 * @retval kStatus_Success SIRC is initialized.
 * @retval kStatus_SCG_Busy SIRC has been enabled and is used by system clock.
 * @retval kStatus_ReadOnly SIRC control register is locked.
 *
 * @note This function can't detect whether the system OSC has been enabled and
 * used by an IP.
 */
status_t CLOCK_InitSirc(const scg_sirc_config_t *config);

/*!
 * @brief De-initializes the SCG slow IRC.
 *
 * This function disables the SCG slow IRC.
 *
 * @retval kStatus_Success SIRC is deinitialized.
 * @retval kStatus_SCG_Busy SIRC is used by system clock.
 * @retval kStatus_ReadOnly SIRC control register is locked.
 *
 * @note This function can't detect whether the SIRC is used by an IP.
 */
status_t CLOCK_DeinitSirc(void);

/*!
 * @brief Gets the SCG SIRC clock frequency.
 *
 * @return  Clock frequency; If the clock is invalid, returns 0.
 */
uint32_t CLOCK_GetSircFreq(void);

/*!
 * @brief Checks whether the SIRC clock is valid.
 *
 * @return  True if clock is valid, false if not.
 */
static inline bool CLOCK_IsSircValid(void)
{
    return (bool)(CLOCK_REG(&SCG_0->SIRCCSR) & SCG_SIRCCSR_SIRCVLD_MASK);
}

/*!
 * @brief Unlock the SIRCCSR control status register.
 */
static inline void CLOCK_UnlockSircControlStatusReg(void)
{
    CLOCK_REG(&SCG_0->SIRCCSR) &= ~(SCG_SIRCCSR_LK_MASK);
}

/*!
 * @brief Lock the SIRCCSR control status register.
 */
static inline void CLOCK_LockSircControlStatusReg(void)
{
    CLOCK_REG(&SCG_0->SIRCCSR) |= SCG_SIRCCSR_LK_MASK;
}

/* @} */

/*!
 * @name SCG Fast IRC Clock.
 * @{
 */

/*!
 * @brief Initializes the SCG fast IRC clock.
 *
 * This function enables the SCG fast IRC clock according to the configuration.
 *
 * @param config   Pointer to the configuration structure.
 * @retval kStatus_Success FIRC is initialized.
 * @retval kStatus_SCG_Busy FIRC has been enabled and is used by the system clock.
 * @retval kStatus_ReadOnly FIRC control register is locked.
 *
 * @note This function can't detect whether the FIRC has been enabled and
 * used by an IP.
 */
status_t CLOCK_InitFirc(const scg_firc_config_t *config);

/*!
 * @brief De-initializes the SCG fast IRC.
 *
 * This function disables the SCG fast IRC.
 *
 * @retval kStatus_Success FIRC is deinitialized.
 * @retval kStatus_SCG_Busy FIRC is used by the system clock.
 * @retval kStatus_ReadOnly FIRC control register is locked.
 *
 * @note This function can't detect whether the FIRC is used by an IP.
 */
status_t CLOCK_DeinitFirc(void);

/*!
 * @brief Gets the SCG FIRC clock frequency.
 *
 * @return  Clock frequency; If the clock is invalid, returns 0.
 */
uint32_t CLOCK_GetFircFreq(void);

/*!
 * @brief Checks whether the FIRC clock error occurs.
 *
 * @return  True if the error occurs, false if not.
 */
static inline bool CLOCK_IsFircErr(void)
{
    return (bool)(CLOCK_REG(&SCG_0->FIRCCSR) & SCG_FIRCCSR_FIRCERR_MASK);
}

/*!
 * @brief Clears the FIRC clock error.
 */
static inline void CLOCK_ClearFircErr(void)
{
    CLOCK_REG(&SCG_0->FIRCCSR) |= SCG_FIRCCSR_FIRCERR_MASK;
}

/*!
 * @brief Checks whether the FIRC clock is valid.
 *
 * @return  True if clock is valid, false if not.
 */
static inline bool CLOCK_IsFircValid(void)
{
    return (bool)(CLOCK_REG(&SCG_0->FIRCCSR) & SCG_FIRCCSR_FIRCVLD_MASK);
}

/*!
 * @brief Unlock the FIRCCSR control status register.
 */
static inline void CLOCK_UnlockFircControlStatusReg(void)
{
    CLOCK_REG(&SCG_0->FIRCCSR) &= ~(SCG_FIRCCSR_LK_MASK);
}

/*!
 * @brief Lock the FIRCCSR control status register.
 */
static inline void CLOCK_LockFircControlStatusReg(void)
{
    CLOCK_REG(&SCG_0->FIRCCSR) |= SCG_FIRCCSR_LK_MASK;
}

/*!
 * @brief Check whether FIRC auto trim locked to target frequency range.
 *
 * When FIRCTREN and FIRCTRUP are enabled, TRIM_LOCK will indicate when auto
 * trimming is complete and output FIRC frequency has locked to target FIRC range.
 * TRIM_LOCK will automatically get cleared if FIRCTREN and FIRCTRUP are not set.
 *
 * @return True if FIRC trim locked to target frequency range, false if not.
 */
static inline bool CLOCK_IsFIRCAutoTrimLocked(void)
{
    return ((bool)(CLOCK_REG(&SCG_0->FIRCCSR) & SCG_FIRCCSR_TRIM_LOCK_MASK));
}

/*!
 * @brief Initializes the SCG ROSC.
 *
 * This function enables the SCG ROSC clock according to the
 * configuration.
 *
 * @param config   Pointer to the configuration structure.
 * @retval kStatus_Success ROSC is initialized.
 * @retval kStatus_SCG_Busy ROSC has been enabled and is used by the system clock.
 * @retval kStatus_ReadOnly ROSC control register is locked.
 *
 * @note This function can't detect whether the system OSC has been enabled and
 * used by an IP.
 */
status_t CLOCK_InitRosc(const scg_rosc_config_t *config);

/*!
 * @brief De-initializes the SCG ROSC.
 *
 * This function disables the SCG ROSC clock.
 *
 * @retval kStatus_Success System OSC is deinitialized.
 * @retval kStatus_SCG_Busy System OSC is used by the system clock.
 * @retval kStatus_ReadOnly System OSC control register is locked.
 *
 * @note This function can't detect whether the ROSC is used by an IP.
 */
status_t CLOCK_DeinitRosc(void);

/*!
 * @brief Gets the SCG RTC OSC clock frequency.
 *
 * @return  Clock frequency; If the clock is invalid, returns 0.
 */
uint32_t CLOCK_GetRtcOscFreq(void);

/*!
 * @brief Gets the clock frequency of the clock 1MHz, 1MHZ is derived out of FRO6M.
 *
 * @return  Clock frequency; If the clock is invalid, returns 0.
 */
uint32_t CLOCK_Get1MClkFreq(void);

/*!
 * @brief Gets the frequency of the TSTMR.
 *
 * @param instance TSTMR instance.
 *
 * @return Clock frequency of the TSTMR instance; If the instance is invalid, returns 0.
 */
uint32_t CLOCK_GetTstmrFreq(uint32_t instance);

/*!
 * @brief Checks whether the ROSC clock error occurs.
 *
 * @return  True if the error occurs, false if not.
 */
static inline bool CLOCK_IsRoscErr(void)
{
    return (bool)(CLOCK_REG(&SCG_0->ROSCCSR) & SCG_ROSCCSR_ROSCERR_MASK);
}

/*!
 * @brief Clears the ROSC clock error.
 */
static inline void CLOCK_ClearRoscErr(void)
{
    CLOCK_REG(&SCG_0->ROSCCSR) |= SCG_ROSCCSR_ROSCERR_MASK;
}

/*!
 * @brief Sets the ROSC monitor mode.
 *
 * This function sets the ROSC monitor mode. The mode can be disabled,
 * it can generate an interrupt when the error is disabled, or reset when the error is detected.
 *
 * @param mode Monitor mode to set.
 */
static inline void CLOCK_SetRoscMonitorMode(scg_rosc_monitor_mode_t mode)
{
    uint32_t reg = CLOCK_REG(&SCG_0->ROSCCSR);

    reg &= ~(SCG_ROSCCSR_ROSCCM_MASK | SCG_ROSCCSR_ROSCCMRE_MASK);

    reg |= (uint32_t)mode;

    CLOCK_REG(&SCG_0->ROSCCSR) = reg;
}

/*!
 * @brief Checks whether the ROSC clock is valid.
 *
 * @return  True if clock is valid, false if not.
 */
static inline bool CLOCK_IsRoscValid(void)
{
    return (bool)(CLOCK_REG(&SCG_0->ROSCCSR) & SCG_ROSCCSR_ROSCVLD_MASK);
}

/*!
 * @brief Unlock the ROSCCSR control status register.
 */
static inline void CLOCK_UnlockRoscControlStatusReg(void)
{
    CLOCK_REG(&SCG_0->ROSCCSR) &= ~(SCG_ROSCCSR_LK_MASK);
}

/*!
 * @brief Lock the ROSCCSR control status register.
 */
static inline void CLOCK_LockRoscControlStatusReg(void)
{
    CLOCK_REG(&SCG_0->ROSCCSR) |= SCG_ROSCCSR_LK_MASK;
}

/*!
 * @name External clock frequency
 * @{
 */

/*!
 * @brief Sets the XTAL0 frequency based on board settings.
 *
 * @param freq The XTAL0/EXTAL0 input clock frequency in Hz.
 */
static inline void CLOCK_SetXtal0Freq(uint32_t freq)
{
    g_xtal0Freq = freq;
    __DMB();
}

/*!
 * @brief Sets the XTAL32 frequency based on board settings.
 *
 * @param freq The XTAL32/EXTAL32 input clock frequency in Hz.
 */
static inline void CLOCK_SetXtal32Freq(uint32_t freq)
{
    g_xtal32Freq = freq;
    __DMB();
}

/* @} */

#if defined(__cplusplus)
}
#endif /* __cplusplus */

/*! @} */

#endif /* _FSL_CLOCK_H_ */
